.. _bankaccount_userguide:

New Zealand Bank Account Numbers
================================

Introduction
------------

The function :func:`clean_nz_bankaccount() <dataprep.clean.clean_nz_bankaccount.clean_nz_bankaccount>` cleans a column containing New Zealand bank account number (bankaccount) strings, and standardizes them in a given format. The function :func:`validate_nz_bankaccount() <dataprep.clean.clean_nz_bankaccount.validate_nz_bankaccount>` validates either a single bankaccount strings, a column of bankaccount strings or a DataFrame of bankaccount strings, returning `True` if the value is valid, and `False` otherwise.

bankaccount strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "0102420100194000"
* `standard`: bankaccount strings with proper whitespace in the proper places, like "01-0242-0100194-000"
* `info`: return a dictionary of data about the supplied number, like {'bank': 'ANZ Bank New Zealand', 'branch': 'ANZ Retail'}. This typically returns the name of the bank and branch and a BIC if it is valid.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_nz_bankaccount()` and `validate_nz_bankaccount()`.

### An example dataset containing bankaccount strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "bankaccount": [
            "0102420100194000",
            "01-0242-0100195-00",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

          bankaccount                                           address
0    0102420100194000                                     123 Pine Ave.
1  01-0242-0100195-00                                           main st
2         999 999 999                      1234 west main heights 57033
3           004085616                    apt 1 789 s maple rd manhattan
4         002 724 334                robie house, 789 north main street
5               hello         1111 S Figueroa St, Los Angeles, CA 90015
6                 NaN  (staples center) 1111 S Figueroa St, Los Angeles
7                NULL                                             hello

## 1. Default `clean_nz_bankaccount`

By default, `clean_nz_bankaccount` will clean bankaccount strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_nz_bankaccount
clean_nz_bankaccount(df, column = "bankaccount")

,bankaccount,address,bankaccount_clean
0,0102420100194000,123 Pine Ave.,01-0242-0100194-000
1,01-0242-0100195-00,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_nz_bankaccount(df, column = "bankaccount", output_format="standard")

,bankaccount,address,bankaccount_clean
0,0102420100194000,123 Pine Ave.,01-0242-0100194-000
1,01-0242-0100195-00,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_nz_bankaccount(df, column = "bankaccount", output_format="compact")

,bankaccount,address,bankaccount_clean
0,0102420100194000,123 Pine Ave.,0102420100194000
1,01-0242-0100195-00,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `info`

In [5]:
clean_nz_bankaccount(df, column = "bankaccount", output_format="info")

,bankaccount,address,bankaccount_clean
0,0102420100194000,123 Pine Ave.,"{'bank': 'ANZ Bank New Zealand', 'branch': 'AN..."
1,01-0242-0100195-00,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned bankaccount strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_nz_bankaccount(df, column="bankaccount", inplace=True)

     bankaccount_clean                                           address
0  01-0242-0100194-000                                     123 Pine Ave.
1                  NaN                                           main st
2                  NaN                      1234 west main heights 57033
3                  NaN                    apt 1 789 s maple rd manhattan
4                  NaN                robie house, 789 north main street
5                  NaN         1111 S Figueroa St, Los Angeles, CA 90015
6                  NaN  (staples center) 1111 S Figueroa St, Los Angeles
7                  NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_nz_bankaccount(df, "bankaccount", errors="coerce")

,bankaccount,address,bankaccount_clean
0,0102420100194000,123 Pine Ave.,01-0242-0100194-000
1,01-0242-0100195-00,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [8]:
clean_nz_bankaccount(df, "bankaccount", errors="ignore")

,bankaccount,address,bankaccount_clean
0,0102420100194000,123 Pine Ave.,01-0242-0100194-000
1,01-0242-0100195-00,main st,01-0242-0100195-00
2,999 999 999,1234 west main heights 57033,999 999 999
3,004085616,apt 1 789 s maple rd manhattan,004085616
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_nz_bankaccount()`

`validate_nz_bankaccount()` returns `True` when the input is a valid bankaccount. Otherwise it returns `False`.

The input of `validate_nz_bankaccount()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_nz_bankaccount()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_nz_bankaccount()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_nz_bankaccount
print(validate_nz_bankaccount("0102420100194000"))
print(validate_nz_bankaccount("01-0242-0100195-00"))
print(validate_nz_bankaccount("999 999 999"))
print(validate_nz_bankaccount("51824753556"))
print(validate_nz_bankaccount("004085616"))
print(validate_nz_bankaccount("hello"))
print(validate_nz_bankaccount(np.nan))
print(validate_nz_bankaccount("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_nz_bankaccount(df["bankaccount"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: bankaccount, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_nz_bankaccount(df, column="bankaccount")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: bankaccount, dtype: bool

### Only DataFrame

In [12]:
validate_nz_bankaccount(df)

   bankaccount  address
0         True    False
1        False    False
2        False    False
3        False    False
4        False    False
5        False    False
6        False    False
7        False    False